#pragma once

#include "FlightData.h"

#include <chrono>
#include <mutex>

//==================================================
// 数据管理器
// 负责保存整个程序唯一的一份飞控数据
//==================================================
class DataManager
{
public:

    //--------------------------------------------------
    // 更新数据
    //--------------------------------------------------
    void Update(const FlightData& data);

    //--------------------------------------------------
    // 获取数据（只读）
    //--------------------------------------------------
    FlightData GetFlightData() const;


   
    
    //--------------------------------------------------
    // 判断飞控是否在线
    //--------------------------------------------------
    bool IsOnline() const;

    //--------------------------------------------------
    // 根据最近一次心跳刷新在线状态
    //--------------------------------------------------
    bool RefreshOnlineStatus(
        std::chrono::steady_clock::time_point now,
        std::chrono::milliseconds timeout);

private:

    //--------------------------------------------------
    // 当前飞控数据
    //--------------------------------------------------
    FlightData flightData;

    mutable std::mutex mutex;
};
